AramVartanyan/mppt-1k/project/mppt-hap/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s2"

# Firmware version: single source of truth (app descriptor, HomeKit Firmware
# Revision and the fupdateota version check all read this value).
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="0.1.0"

# OTA (general-ota); server certificates come from the mbedTLS bundle below
CONFIG_GENERAL_OTA_URL="https://raw.githubusercontent.com/AramVartanyan/otafw/master/mppt1hs2.bin"

# Partitions (4 MB, two 1600 KB OTA slots, HomeKit factory_nvs / nvs_keys)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_hap.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU / compiler
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Task watchdog stays enabled: the control task must never stall silently.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# LWIP (HomeKit needs several concurrent controller sockets)
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_ACTIVE_TCP=12
CONFIG_LWIP_MAX_LISTENING_TCP=12
CONFIG_LWIP_UDP_RECVMBOX_SIZE=10
CONFIG_LWIP_LOCAL_HOSTNAME="mppt1hs2"
CONFIG_LWIP_AUTOIP=y
CONFIG_LWIP_AUTOIP_RATE_LIMIT_INTERVAL=60
CONFIG_LWIP_DHCPS=y

# mbedTLS (certificate bundle is required by general-ota)
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HomeKit SDK
# Room for the application web page handlers next to the 8 HAP URIs.
CONFIG_HAP_HTTP_MAX_URI_HANDLERS=20

# Console: UART0 (T6 header). Switch to USB CDC later if preferred:
# CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
